{"data":{"page":{"html":"<blockquote>\n<p>This is not a test! Seriously, try and have fun with it, make it your own!</p>\n</blockquote>\n<h2>Introduction</h2>\n<ul>\n<li>😍 Be sure to write comments, a README and any assumptions. Provide instructions on how to run the project and any notes about your solution.</li>\n<li>🤩 Feel free to use a JavaScript framework, we use React, Vue and plain JavaScript here but use what you’re most comfortable with.</li>\n<li>🤨 You can also use a starter kit like <a href=\"https://github.com/facebook/create-react-app#readme\">Create React App</a> or <a href=\"https://vuejs.org/v2/guide/installation.html#CLI\">Vue CLI</a> to save time.</li>\n<li>🤗 UI is great but a clean layout and typography will do.</li>\n<li>🧐 We’re most interested to see problem solving and your approach… also ES6 please.</li>\n<li>😇 Keep it simple, keep it DRY, but don’t over complicate or over engineer, comment and test as much as possible.</li>\n<li>🤓 Commit your code to a public Git repository and provide us with the URL.</li>\n</ul>\n<h2>Brief</h2>\n<p>You have a toy robot on a table top, a grid of 5 x 5 units, there are no obstructions. You can issue commands to your robot allowing it to roam around the table top. But be careful, don't let it fall off!</p>\n<p>Create an app that allows <a href=\"#input-commands\">commands</a> to be issued to the robot. The robot should be prevented from failing off the table top to its destruction.</p>\n<p>A failed command should not stop the app, valid commands should be allowed.</p>\n<p>The application should discard all commands until a valid <code>place()</code> command has been executed.</p>\n<p>0, 0 on the grid should be seen as bottom left.</p>\n<h2>Input</h2>\n<blockquote>\n<p>Every command should provide visual output that the command has either succeeded or failed.</p>\n</blockquote>\n<h3><code>place(x, y, facing)</code></h3>\n<ul>\n<li><code>x</code> and <code>y</code> are integers that relate to a location on the grid. Values that are outside the boundary of the grid should not be allowed.</li>\n<li><code>facing</code> is a string referencing the direction the robot is facing. Values <code>NORTH</code>, <code>SOUTH</code>, <code>EAST</code> or <code>WEST</code> are allowed.</li>\n</ul>\n<h3><code>move()</code></h3>\n<p>Moves the robot 1 grid unit in the direction it is facing unless that movement will cause the robot to fall off the grid.</p>\n<h3><code>left()</code></h3>\n<p>Rotate the robot 90° anticlockwise/counterclockwise.</p>\n<h3><code>right()</code></h3>\n<p>Rotate the robot 90° clockwise.</p>\n<h3><code>report()</code></h3>\n<p>Outputs the robot's current grid location and facing direction.</p>\n<h2>Output</h2>\n<ul>\n<li><code>place(0, 0, 'NORTH')</code></li>\n<li><code>move()</code></li>\n<li><code>report()</code> <em>=> Output: 0, 1, NORTH</em></li>\n<li><code>place(0, 0, NORTH)</code></li>\n<li><code>left()</code></li>\n<li><code>report()</code> <em>=> Output: 0, 0, WEST</em></li>\n<li><code>place(1, 2, EAST)</code></li>\n<li><code>move()</code></li>\n<li><code>move()</code></li>\n<li><code>left()</code></li>\n<li><code>move()</code></li>\n<li><code>report()</code> <em>=> Output: 3, 3, NORTH</em></li>\n</ul>","frontmatter":{"description":"Don't let the robot fall off the table!","subTitle":"Frontend","title":"Toy robot challenge"}}},"pageContext":{"description":"Don't let the robot fall off the table!","subTitle":"Frontend","title":"Toy robot challenge","slug":"/frontend/toy-robot","subPageRegex":"/^/frontend/toy-robot//"}}